In [1]:
import pandas as pd

In [2]:
# reading the CSV file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Math Operations

## 1.1 Operations in columns

In [3]:
# select a column to calculate toal sum
df_exams['math score'].sum()

np.int64(66089)

In [6]:
# count, mean, std, min and max
print(f"Count: {df_exams['math score'].count()}")
print(f"Mean: {df_exams['math score'].mean()}")
print(f"Std: {df_exams['math score'].std()}")
print(f"Min: {df_exams['math score'].min()}")
print(f"Max: {df_exams['math score'].max()}")

Count: 1000
Mean: 66.089
Std: 15.16308009600945
Min: 0
Max: 100

In [7]:
# Easier way to get all statistics
print(df_exams['math score'].describe())

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

## 1.2 Operations in rows

In [9]:
# calculating the sum in a row
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [12]:
# calculating the average score and assiging the result in the row
df_exams['average score'] = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']) / 3
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333